### Add/Remove rows and columns

Adding columns

In [2]:
import pandas as pd
people = {
    'first_name': ['Corey', 'Jane', 'Lee', 'Lee'],
    'last_name': ['Chou', 'Kalvin', 'Leo', 'Dan'],
    'email': ['aaa', 'bbb', 'ccc', 'ddd']
}
df_people = pd.DataFrame(people)

In [3]:
df_people

  first_name last_name email
0      Corey      Chou   aaa
1       Jane    Kalvin   bbb
2        Lee       Leo   ccc
3        Lee       Dan   ddd

In [4]:
df_people['full_name'] = df_people['first_name'] + ' ' + df_people['last_name']

In [5]:
df_people

  first_name last_name email    full_name
0      Corey      Chou   aaa   Corey Chou
1       Jane    Kalvin   bbb  Jane Kalvin
2        Lee       Leo   ccc      Lee Leo
3        Lee       Dan   ddd      Lee Dan

remove columns

In [6]:
df_people.drop(columns=['first_name', 'last_name'], inplace=True)

In [7]:
df_people

  email    full_name
0   aaa   Corey Chou
1   bbb  Jane Kalvin
2   ccc      Lee Leo
3   ddd      Lee Dan

Break down a column into two columns

In [8]:
df_people['full_name'].str.split(' ', expand=True)

       0       1
0  Corey    Chou
1   Jane  Kalvin
2    Lee     Leo
3    Lee     Dan

In [9]:
df_people[['first_n', 'last_n']] = df_people['full_name'].str.split(' ', expand=True)

In [10]:
df_people

  email    full_name first_n  last_n
0   aaa   Corey Chou   Corey    Chou
1   bbb  Jane Kalvin    Jane  Kalvin
2   ccc      Lee Leo     Lee     Leo
3   ddd      Lee Dan     Lee     Dan

Adding single row data

In [12]:
df_people.append({'first_n':'Tony', 'last_n':'Wang'}, ignore_index=True)

/var/folders/93/h12kgbnx5z3b92f_2l14r_yh0000gn/T/ipykernel_37819/2408422773.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_people.append({'first_n':'Tony', 'last_n':'Wang'}, ignore_index=True)

  email    full_name first_n  last_n
0   aaa   Corey Chou   Corey    Chou
1   bbb  Jane Kalvin    Jane  Kalvin
2   ccc      Lee Leo     Lee     Leo
3   ddd      Lee Dan     Lee     Dan
4   NaN          NaN    Tony    Wang

Adding one DF to other

In [13]:
people = {
    'first_n': ['Tony', 'Steve'],
    'last_n': ['Stark', 'Rogers'],
    'email': ['ironman@avenge.com', 'cap@avenge.com']
}
df_people2 = pd.DataFrame(people)

In [14]:
df_people2

  first_n  last_n               email
0    Tony   Stark  ironman@avenge.com
1   Steve  Rogers      cap@avenge.com

In [15]:
df_people.append(df_people2, ignore_index=True)
# append() doesn't have inplace argument like the drop method has.

/var/folders/93/h12kgbnx5z3b92f_2l14r_yh0000gn/T/ipykernel_37819/574734371.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_people.append(df_people2, ignore_index=True)

                email    full_name first_n  last_n
0                 aaa   Corey Chou   Corey    Chou
1                 bbb  Jane Kalvin    Jane  Kalvin
2                 ccc      Lee Leo     Lee     Leo
3                 ddd      Lee Dan     Lee     Dan
4  ironman@avenge.com          NaN    Tony   Stark
5      cap@avenge.com          NaN   Steve  Rogers

In [16]:
df_new = df_people.append(df_people2, ignore_index=True, sort=False)

/var/folders/93/h12kgbnx5z3b92f_2l14r_yh0000gn/T/ipykernel_37819/3526157065.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_new = df_people.append(df_people2, ignore_index=True, sort=False)

In [17]:
df_new

                email    full_name first_n  last_n
0                 aaa   Corey Chou   Corey    Chou
1                 bbb  Jane Kalvin    Jane  Kalvin
2                 ccc      Lee Leo     Lee     Leo
3                 ddd      Lee Dan     Lee     Dan
4  ironman@avenge.com          NaN    Tony   Stark
5      cap@avenge.com          NaN   Steve  Rogers

remove a row

In [23]:
df_new.drop(index=[3,4])

            email    full_name first_n  last_n
0             aaa   Corey Chou   Corey    Chou
1             bbb  Jane Kalvin    Jane  Kalvin
2             ccc      Lee Leo     Lee     Leo
5  cap@avenge.com          NaN   Steve  Rogers

In [24]:
print(df_new['first_n'] == 'Lee')
print(df_new[df_new['first_n'] == 'Lee'].index)
df_new.drop(index=df_new[df_new['first_n']=='Lee'].index)

0    False
1    False
2     True
3     True
4    False
5    False
Name: first_n, dtype: bool
Int64Index([2, 3], dtype='int64')

                email    full_name first_n  last_n
0                 aaa   Corey Chou   Corey    Chou
1                 bbb  Jane Kalvin    Jane  Kalvin
4  ironman@avenge.com          NaN    Tony   Stark
5      cap@avenge.com          NaN   Steve  Rogers